levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_pwc.c
/**
 *******************************************************************************
 * @file  hc32m423_pwc.c
 * @brief This file provides firmware functions to manage the Power Contorl(PWC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-07-09       Chengy          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_pwc.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_PWC PWC
 * @brief Power Control Driver Library
 * @{
 */

#if (DDL_PWC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup PWC_Local_Macros PWC Local Macros
 * @{
 */
#define PWC_LVD_CR0_MASK            (PWR_LVDCR0_L1IEGS | PWR_LVDCR0_L1LVL  | \
                                     PWR_LVDCR0_L1NFS  | PWR_LVDCR0_L1NMIS | \
                                     PWR_LVDCR0_L1IRS  | PWR_LVDCR0_L1IRE  | \
                                     PWR_LVDCR0_L1CMPOE)

#define PWC_LVD2_CONFIG_SHIFT       ((uint32_t)16UL)

/**
 * @defgroup PWC_Check_Parameters_Validity PWC Check Parameters Validity
 * @{
 */



/*  Parameter validity check for stop mode high POR sel. */
#define IS_VALID_PWC_STOP_HPOR_SEL(sel)                                        \
(       ((sel) == PWC_HPOR_ON)                  ||                             \
        ((sel) == PWC_HPOR_OFF))

/*  Parameter validity check for system clock sel while awake stop mode. */
#define IS_VALID_PWC_STOP_SYSCLK_SEL(sel)                                      \
(       ((sel) == PWC_SYSCLK_FIX)               ||                             \
        ((sel) == PWC_SYSCLK_HRCDIVX))

/*  Parameter validity check for power monitor. */
#define IS_VALID_PWC_PWRMON_EN(x)                                              \
(       ((x) == PWC_PWRMON_ON)                  ||                             \
        ((x) == PWC_PWRMON_OFF))

/*  Parameter validity check for power monitor sel. */
#define IS_VALID_PWC_PWRMON_SEL(sel)                                           \
(       ((sel) == PWC_PWRMON_VINREF)            ||                             \
        ((sel) == PWC_PWRMON_VOTS))

/*  Parameter validity check for LVD Level. */
#define IS_VALID_PWC_LVD_LEVEL(level)                                          \
(       ((level) == PWC_LVD_LEVEL0)             ||                             \
        ((level) == PWC_LVD_LEVEL1)             ||                             \
        ((level) == PWC_LVD_LEVEL2)             ||                             \
        ((level) == PWC_LVD_LEVEL3)             ||                             \
        ((level) == PWC_LVD_LEVEL4)             ||                             \
        ((level) == PWC_LVD_LEVEL5)             ||                             \
        ((level) == PWC_LVD_LEVEL6)             ||                             \
        ((level) == PWC_LVD_LEVEL7)             ||                             \
        ((level) == PWC_LVD_LEVEL8)             ||                             \
        ((level) == PWC_LVD_LEVEL9)             ||                             \
        ((level) == PWC_LVD_LEVEL10)            ||                             \
        ((level) == PWC_LVD_LEVEL11)            ||                             \
        ((level) == PWC_LVD_INP))

/*  Parameter validity check for LVD Level. */
#define IS_VALID_PWC_LVD_DFS_SEL(sel)                                          \
(       ((sel) == PWC_LVD_DFS_2)                ||                             \
        ((sel) == PWC_LVD_DFS_4)                ||                             \
        ((sel) == PWC_LVD_DFS_8)                ||                             \
        ((sel) == PWC_LVD_DFS_16))

