levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_pwc.c
/*  Parameter validity check for LVD flag. */
#define IS_VALID_PWC_LVD_FLAG(flag)                                            \
(       ((flag) == PWC_LVD_FLAG_DET)            ||                             \
        ((flag) == PWC_LVD_FLAG_LVI))

/*  Parameter validity check for Ram protect area selection. */
#define IS_VALID_PWC_RAM_PRAT_SEL(sel)                                         \
(       ((sel) == PWC_RAM_PRTA_NONE)            ||                             \
        ((sel) == PWC_RAM_PRTA_128)             ||                             \
        ((sel) == PWC_RAM_PRTA_256)             ||                             \
        ((sel) == PWC_RAM_PRTA_512))



/*  Parameter validity check for PWC LDO Flag. */
#define IS_VALID_PWC_LDO_Flag(x)                                               \
(       ((x) == PWC_FLAG_LDO_PLL)               ||                             \
        ((x) == PWC_FLAG_LDO_HRC))

/*  Parameter validity check for PWC Power Monitor. */
#define IS_VALID_PWC_POWER_MONITOR(x)                                          \
(       ((x) == PWC_POWER_MONITOR_DISABLE)                  ||                 \
        ((x) == PWC_POWER_MONITOR_INTERNAL_REF_VOL)         ||                 \
        ((x) == PWC_POWER_MONITOR_TEMP_SENSOR_VOL))

/*  Parameter validity check for PWC LVD normal unit. */
#define IS_VALID_PWC_LVD_NORMAL_UNIT(x)                                        \
(       ((x) == PWC_LVD1)                       ||                             \
        ((x) == PWC_LVD2))

/*  Parameter validity check for PWC LVD special unit. */
#define IS_VALID_PWC_LVD_SPECIAL_UNIT(x)                                       \
(       ((x) == PWC_LVD0)                       ||                             \
        ((x) == PWC_LVD1)                       ||                             \
        ((x) == PWC_LVD2))

/*  Parameter validity check for PWC LVD External Input. */
#define IS_VALID_PWC_LVD_EX_INPUT(x)                                           \
(       ((x) == PWC_LVD_EX_INPUT_DISABLE)       ||                             \
        ((x) == PWC_LVD_EX_INPUT_ENABLE))

/*  Parameter validity check for PWC LVD Detect Edge. */
#define IS_VALID_PWC_LVD_DETECT_EDGE(x)                                        \
(       ((x) == PWC_LVD_DETECT_EDGE_RISING)     ||                             \
        ((x) == PWC_LVD_DETECT_EDGE_FALLING)    ||                             \
        ((x) == PWC_LVD_DETECT_EDGE_RISING_FALLING))

/*  Parameter validity check for PWC LVD voltage threshold. */
#define IS_VALID_PWC_LVD_VOL_THRESHOLD(x)                                      \
(       ((x) == PWC_LVD_VOL_BELOW4P29_OR_ABOVE4P39)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW4P14_OR_ABOVE4P23)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW4P02_OR_ABOVE4P14)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW3P84_OR_ABOVE3P96)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW3P10_OR_ABOVE3P20)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW3P00_OR_ABOVE3P09)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW2P90_OR_ABOVE2P99)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW2P79_OR_ABOVE2P87)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW2P68_OR_ABOVE2P75)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW2P34_OR_ABOVE2P41)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW2P14_OR_ABOVE2P21)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW1P94_OR_ABOVE2P01)         ||                 \
        ((x) == PWC_LVD_VOL_BELOW1P84_OR_ABOVE1P90)         ||                 \
        ((x) == PWC_LVD_VOL_EX_INPUT)) 

/*  Parameter validity check for PWC LVD Filter. */
#define IS_VALID_PWC_LVD_FILTER(x)                                             \
(       ((x) == PWC_LVD_FILTER_DISABLE)         ||                             \
        ((x) == PWC_LVD_FILTER_CLK_LRC_0P25)    ||                             \
        ((x) == PWC_LVD_FILTER_CLK_LRC_0P5)     ||                             \
        ((x) == PWC_LVD_FILTER_CLK_LRC_DIV1)    ||                             \
        ((x) == PWC_LVD_FILTER_CLK_LRC_DIV2))

/*  Parameter validity check for PWC LVD Trigger Event. */
#define IS_VALID_PWC_LVD_TRIG_EVENT(x)                                         \
(       ((x) == PWC_LVD_TRIG_DISABLE)           ||                             \
        ((x) == PWC_LVD_TRIG_RESET)             ||                             \
        ((x) == PWC_LVD_TRIG_NMI_INTERRUPT)     ||                             \
        ((x) == PWC_LVD_TRIG_MI_INTERRUPT))

/*  Parameter validity check for PWC LVD Comparer Output. */
#define IS_VALID_PWC_LVD_CMP_OUTPUT(x)                                         \
(       ((x) == PWC_LVD_COMPARER_OUTPUT_DISABLE)            ||                 \
        ((x) == PWC_LVD_COMPARER_OUTPUT_ENABLE))

/*  Parameter validity check for Ram Parity flag. */
#define IS_VALID_PWC_RAM_PARITY_FLAG(x)                                        \
(       ((x) == PWC_FLAG_CACHE_PARITY_ERR)      ||                             \
        ((x) == PWC_FLAG_HRAM_PARITY_ERR)       ||                             \
        ((x) == PWC_FLAG_RAM_PARITY_ERR))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup PWC_Global_Functions PWC Global Functions
 * @{
 */

/**
 * @brief  Enter stop mode.
 * @param  None
 * @retval None
 */
void PWC_EnterStopMode(void)
{
    PWC_POWER_REG_WRITE_ENABLE();

    SET_REG8_BIT(M4_PWC->STPMCR, PWC_STPMCR_STOP);

