levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_pwc.c
    PWC_POWER_REG_WRITE_DISABLE();

     __WFI();
}

/**
 * @brief  Enter sleep mode.
 * @param  None
 * @retval None
 */
void PWC_EnterSleepMode(void)
{
    PWC_POWER_REG_WRITE_ENABLE();

    bM4_PWC->STPMCR_b.STOP = 0U;

    PWC_POWER_REG_WRITE_DISABLE();

     __WFI();
}

/**
 * @brief  Switch high speed to low speed, set the LDO driver ability.
 * @param  None
 * @retval None
 */
void PWC_HighSpeedToLowSpeed(void)
{
    PWC_POWER_REG_WRITE_ENABLE();

    MODIFY_REG32(M4_PWC->PWRC, PWC_PWRC_PWDRV , PWC_DRV_LOW);

    DDL_Delay1ms(1U);

    PWC_POWER_REG_WRITE_DISABLE();
}

/**
 * @brief  Switch low speed to high speed, set the LDO driver ability.
 * @param  None
 * @retval None
 */
void PWC_LowSpeedToHighSpeed(void)
{
    PWC_POWER_REG_WRITE_ENABLE();

    MODIFY_REG32(M4_PWC->PWRC, PWC_PWRC_PWDRV , PWC_DRV_HIGH);

    DDL_Delay1ms(1U);

    PWC_POWER_REG_WRITE_DISABLE();
}

/**
 * @brief  Init the stop config structure with default value.
 * @param  [in] pstcStopCfg            The pointer of stop config structure.
 *   @arg u8HPorSel  Specifies the high POR on or off while stop mode.
 *   @arg u8HrcSel   Specifies the system clock while awake from stop mode.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t PWC_StopStructInit(stc_pwc_stop_mode_t* pstcStopCfg)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcStopCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcStopCfg->u8HPorSel = PWC_HPOR_ON;
        pstcStopCfg->u8HrcSel = PWC_SYSCLK_FIX;
    }

    return enRet;
}

/**
 * @brief  Config the stop mode.
 * @param  [in] pstcStopCfg      The pointer of stop config.
 *   @arg u8HPorSel  Specifies the high POR on or off while stop mode.
 *   @arg u8HrcSel   Specifies the system clock while awake from stop mode.
 * @retval None
 */
en_result_t PWC_StopMdConfig(const stc_pwc_stop_mode_t* pstcStopCfg)
{
    en_result_t enRet = Ok;

    if(pstcStopCfg == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter valid check */
        DDL_ASSERT(IS_VALID_PWC_STOP_HPOR_SEL(pstcStopCfg->u8HPorSel));
        DDL_ASSERT(IS_VALID_PWC_STOP_SYSCLK_SEL(pstcStopCfg->u8HrcSel));

        PWC_POWER_REG_WRITE_ENABLE();

        /* Config the stop mode */
        MODIFY_REG8(M4_PWC->STPMCR, PWC_STPMCR_HAPORDIS , pstcStopCfg->u8HPorSel);
        MODIFY_REG8(M4_PWC->STPMCR, PWC_STPMCR_CKSHRC , pstcStopCfg->u8HrcSel);

        PWC_POWER_REG_WRITE_DISABLE();
    }

    return enRet;
}








/**
 * @brief  Get PWC LDO flag status.
 * @param  [in] u16Flag                 PWC LDO flag type.
 *         This parameter can be one or any combination of the following values:
 *           @arg PWC_FLAG_LDO_PLL:     PLL LDO ready flag
 *           @arg PWC_FLAG_LDO_HRC:     HRC LDO ready flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t PWC_GetLdoFlag(uint16_t u16Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LDO_Flag(u16Flag));
    if (Reset != (READ_REG32_BIT(M4_PWR->PWRC, u16Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Set PWC power monitor.
 * @param  [in] u8CfgVal                PWC Monitor configure value
 *         This parameter can be one of the following values:
 *           @arg PWC_POWER_MONITOR_DISABLE:          Disable power monitor
 *           @arg PWC_POWER_MONITOR_INTERNAL_REF_VOL: Monitor internal reference voltage of power supply
 *           @arg PWC_POWER_MONITOR_TEMP_SENSOR_VOL:  Monitor temperature sensor voltage
 * @retval None
 */
void PWC_SetPowerMonitor(uint8_t u8CfgVal)
{
    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_POWER_MONITOR(u8CfgVal));

    PWC_POWER_REG_WRITE_ENABLE();
    MODIFY_REG8(M4_PWR->PWRMONR, (PWR_PWRMONR_PWMONSEL | PWR_PWRMONR_PWMONE), u8CfgVal;
    PWC_POWER_REG_WRITE_DISABLE();
}

/**
 * @brief  De-Initialize PWC LVD function.
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t PWC_LVD_DeInit(uint8_t u8Unit)
{
    en_result_t enRet = Ok;

    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LVD_NORMAL_UNIT(u8Unit));

    PWC_LVD_REG_WRITE_ENABLE();
    if (PWC_LVD1 == u8Unit)
    {
        CLEAR_REG32_BIT(M4_PWR->LVDCR0, 0x0000FFFFUL);
        bM4_PWR->LVDCSR1_b.L1DETF = 0U;
    }
    else
    {
        CLEAR_REG32_BIT(M4_PWR->LVDCR0, 0xFFFF0000UL);
        bM4_PWR->LVDCSR1_b.L2DETF = 0U;
    }
    PWC_LVD_REG_WRITE_DISABLE();
}

/**
 * @brief  Initialize PWC LVD function.
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @param  [in] pstcLvdInit             Pointer to a @ref stc_pwc_lvd_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t PWC_LVD_Init(uint8_t u8Unit, const stc_pwc_lvd_init_t* pstcLvdInit)
{
    en_result_t enRet = Ok;
    uint32_t u32ShiftBit = 0UL;

    if (pstcLvdInit == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter valid check */
        DDL_ASSERT(IS_VALID_PWC_LVD_NORMAL_UNIT(u8Unit));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
        DDL_ASSERT(IS_VALID_PWC_LVD_EX_INPUT(pstcLvdInit->u32ExInputEn));
        DDL_ASSERT(IS_VALID_PWC_LVD_DETECT_EDGE(pstcLvdInit->u32DetectEdge));
        DDL_ASSERT(IS_VALID_PWC_LVD_VOL_THRESHOLD(pstcLvdInit->u32VoltageThreshold));
        DDL_ASSERT(IS_VALID_PWC_LVD_FILTER(pstcLvdInit->u32Filter));
        DDL_ASSERT(IS_VALID_PWC_LVD_TRIG_EVENT(pstcLvdInit->u32TrigEvent));
        DDL_ASSERT(IS_VALID_PWC_LVD_CMP_OUTPUT(pstcLvdInit->u32ComparerOutputEn));

