levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_pwc.c
        if ((PWC_LVD1 == u8Unit) && (PWC_LVD_VOL_EX_INPUT == pstcLvdInit->u32VoltageThreshold))
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            PWC_LVD_REG_WRITE_ENABLE();
            if (PWC_LVD2 == u8Unit)
            {
                u32ShiftBit = PWC_LVD2_CONFIG_SHIFT;
                MODIFY_REG32(M4_PWR->LVDCR0, PWR_LVDCR0_EXVCCINEN, pstcLvdInit->u32ExInputEn);
            }
            /* The filter configuration can only be modified if the LxNFDIS bit is "1" */
            SET_REG32_BIT(M4_PWR->LVDCR0, (PWR_LVDCR0_L1NFDIS << u32ShiftBit));
            MODIFY_REG32(M4_PWR->LVDCR0, (PWC_LVD_CR0_MASK << u32ShiftBit),
                         ((pstcLvdInit->u32DetectEdge | pstcLvdInit->u32VoltageThreshold |
                          pstcLvdInit->u32Filter | pstcLvdInit->u32TrigEvent |
                          pstcLvdInit->u32ComparerOutputEn) << u32ShiftBit);
            PWC_LVD_REG_WRITE_DISABLE();
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_pwc_lvd_init_t to default values.
 * @param  [out] pstcLvdInit            Pointer to a @ref stc_pwc_lvd_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t PWC_LVD_StructInit(stc_pwc_lvd_init_t* pstcLvdInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcLvdInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcLvdInit->u32ExInputEn = PWC_LVD_EX_INPUT_DISABLE;
        pstcLvdInit->u32DetectEdge = PWC_LVD_DETECT_EDGE_RISING;
        pstcLvdInit->u32VoltageThreshold = PWC_LVD_VOL_BELOW4P29_OR_ABOVE4P39;
        pstcLvdInit->u32Filter = PWC_LVD_FILTER_DISABLE;
        pstcLvdInit->u32TrigEvent = PWC_LVD_TRIG_DISABLE;
        pstcLvdInit->u32ComparerOutputEn = PWC_LVD_COMPARER_OUTPUT_DISABLE;
    }

    return enRet;
}

/**
 * @brief  Enable or disable the Low Voltage Detector(LVD).
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @param  [in] enNewState      The new state of the LVD.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_LVD_Cmd(uint8_t u8Unit, en_functional_state_t enNewState)
{
    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LVD_NORMAL_UNIT(u8Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    PWC_LVD_REG_WRITE_ENABLE();
    if (PWC_LVD1 == u8Unit)
    {
        bM4_PWR->LVDCR0_b.L1EN = enNewState;
    }
    else
    {
        bM4_PWR->LVDCR0_b.L2EN = enNewState;
    }
    PWC_LVD_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or disable the LVD compare result output.
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD0: PWC LVD unit 0
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @param  [in] enNewState      The new state of the LVD CmpOutput.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_LVD_CmpOutputCmd(uint8_t u8Unit, en_functional_state_t enNewState)
{
    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LVD_NORMAL_UNIT(u8Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    PWC_LVD_REG_WRITE_ENABLE();
    switch (u8Unit)
    {
    case PWC_LVD0:
        bM4_PWR->LVDCSR1_b.L0CMPOE = enNewState;
        break;
    case PWC_LVD1:
        bM4_PWR->LVDCR0_b.L1CMPOE = enNewState;
        break;
    case PWC_LVD2:
        bM4_PWR->LVDCR0_b.L2CMPOE = enNewState;
        break;
    default:
        break;
    }
    PWC_LVD_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or disable the LVD trigger event.
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @param  [in] enNewState      The new state of the LVD trigger event.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_LVD_TrigEventCmd(uint8_t u8Unit, en_functional_state_t enNewState)
{
    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LVD_NORMAL_UNIT(u8Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    PWC_LVD_REG_WRITE_ENABLE();
    if (PWC_LVD1 == u8Unit)
    {
        bM4_PWR->LVDCR0_b.L1IRE = enNewState;
    }
    else
    {
        bM4_PWR->LVDCR0_b.L2IRE = enNewState;
    }
    PWC_LVD_REG_WRITE_DISABLE();
}

/**
 * @brief  Set LVD compare result.
 * @note   The parameter PWC_LVD_VOL_EX_INPUT only PWC_LVD2 is valid.
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @param  [in] u32VolThreshold         Compare voltage threshold
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD_VOL_BELOW4P29_OR_ABOVE4P39:   LVD voltage threshold less than 4.29 or higher than 4.39
 *           @arg PWC_LVD_VOL_BELOW4P14_OR_ABOVE4P23:   LVD voltage threshold less than 4.14 or higher than 4.23
 *           @arg PWC_LVD_VOL_BELOW4P02_OR_ABOVE4P14:   LVD voltage threshold less than 4.02 or higher than 4.14
 *           @arg PWC_LVD_VOL_BELOW3P84_OR_ABOVE3P96:   LVD voltage threshold less than 3.84 or higher than 3.96
 *           @arg PWC_LVD_VOL_BELOW3P10_OR_ABOVE3P20:   LVD voltage threshold less than 3.10 or higher than 3.20
 *           @arg PWC_LVD_VOL_BELOW3P00_OR_ABOVE3P09:   LVD voltage threshold less than 3.00 or higher than 3.09
 *           @arg PWC_LVD_VOL_BELOW2P90_OR_ABOVE2P99:   LVD voltage threshold less than 2.90 or higher than 2.99
 *           @arg PWC_LVD_VOL_BELOW2P79_OR_ABOVE2P87:   LVD voltage threshold less than 2.79 or higher than 2.87
 *           @arg PWC_LVD_VOL_BELOW2P68_OR_ABOVE2P75:   LVD voltage threshold less than 2.68 or higher than 2.75
 *           @arg PWC_LVD_VOL_BELOW2P34_OR_ABOVE2P41:   LVD voltage threshold less than 2.34 or higher than 2.41
 *           @arg PWC_LVD_VOL_BELOW2P14_OR_ABOVE2P21:   LVD voltage threshold less than 2.14 or higher than 2.21
 *           @arg PWC_LVD_VOL_BELOW1P94_OR_ABOVE2P01:   LVD voltage threshold less than 1.94 or higher than 2.01
 *           @arg PWC_LVD_VOL_BELOW1P84_OR_ABOVE1P90:   LVD voltage threshold less than 1.84 or higher than 1.90
 *           @arg PWC_LVD_VOL_EX_INPUT:                 LVD use external input reference voltage
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t PWC_LVD_SetVolThreshold(uint8_t u8Unit, uint32_t u32VolThreshold)
{
    en_result_t enRet = Ok;

    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LVD_NORMAL_UNIT(u8Unit));
    DDL_ASSERT(IS_VALID_PWC_LVD_VOL_THRESHOLD(u32VolThreshold));

    if ((PWC_LVD1 == u8Unit) && (PWC_LVD_VOL_EX_INPUT == u32VolThreshold))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        PWC_LVD_REG_WRITE_ENABLE();
        if (PWC_LVD1 == u8Unit)
        {
            MODIFY_REG32(M4_PWR->LVDCR0, PWR_LVDCR0_L1LVL, u32VolThreshold);
        }
        else
        {
            MODIFY_REG32(M4_PWR->LVDCR0, PWR_LVDCR0_L2LVL, (u32VolThreshold<<PWC_LVD2_CONFIG_SHIFT));
        }
        PWC_LVD_REG_WRITE_DISABLE();
    }

    return enRet;
}

/**
 * @brief  Get LVD compare result.
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD0: PWC LVD unit 0
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @retval An uint8_t value:
 *           - PWC_LVD_COMPARE_VCC_LESS_LVD:    VCC < VLVD
 *           - PWC_LVD_COMPARE_VCC_GREATER_LVD: VCC = VLVD or LVD is invalid
 */
uint8_t PWC_LVD_GetCmpResult(uint8_t u8Unit)
{
    uint8_t u8Result = PWC_LVD_COMPARE_VCC_LESS_LVD;

    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LVD_SPECIAL_UNIT(u8Unit));

    if (Reset != (READ_REG8_BIT(M4_PWR->LVDCSR1, (PWR_LVDCSR1_L1MON << u8Unit))))
    {
        u8Result = PWC_LVD_COMPARE_VCC_GREATER_LVD;
    }

    return u8Result;

