levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_pwc.c
}

/**
 * @brief  Get LVD detect flag.
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t PWC_LVD_GetDetectFlag(uint8_t u8Unit)
{
    en_flag_status_t enFlagSta = Reset;

    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LVD_NORMAL_UNIT(u8Unit));

    if (Reset != (READ_REG8_BIT(M4_PWR->LVDCSR1, (PWR_LVDCSR1_L1DETF << u8Unit))))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Clear LVD detect flag.
 * @param  [in] u8Unit                  PWC LVD unit number
 *         This parameter can be one of the following values:
 *           @arg PWC_LVD1: PWC LVD unit 1
 *           @arg PWC_LVD2: PWC LVD unit 2
 * @retval None
 */
void PWC_LVD_CleaDetectFlag(uint8_t u8Unit)
{
    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_LVD_NORMAL_UNIT(u8Unit));

    PWC_LVD_REG_WRITE_ENABLE();
    CLEAR_REG8_BIT(M4_PWR->LVDCSR1, (PWR_LVDCSR1_L1DETF << u8Unit));
    PWC_LVD_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or disable the Ram Parity error trigger reset.
 * @param  [in] enNewState      The new state of the Ram Parity error trigger reset.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_RamParityErrResetCmd(en_functional_state_t enNewState)
{
    /* Parameter valid check */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    PWC_POWER_REG_WRITE_ENABLE();
    bM4_PWR->RAMCR_b.RPERDIS = !enNewState;
    PWC_POWER_REG_WRITE_DISABLE();
}

/**
 * @brief  Get the ram parity check flag.
 * @param  [in] u16Flag                 PWC Ram Parity flag type
 *         This parameter can be one of the following values:
 *           @arg PWC_FLAG_CACHE_PARITY_ERR:    Cache Ram parity error flag
 *           @arg PWC_FLAG_HRAM_PARITY_ERR:     High RAM parity error flag
 *           @arg PWC_FLAG_RAM_PARITY_ERR:      RAM parity error flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t PWC_GetRamParityFlag(uint8_t u8Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_RAM_PARITY_FLAG(u8Flag));

    if (Reset != (READ_REG8_BIT(M4_PWR->RAMCR, u8Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Clear the ram parity check flag.
 * @param  [in] u16Flag                 PWC Ram Parity flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg PWC_FLAG_CACHE_PARITY_ERR:    Cache Ram parity error flag
 *           @arg PWC_FLAG_HRAM_PARITY_ERR:     High RAM parity error flag
 *           @arg PWC_FLAG_RAM_PARITY_ERR:      RAM parity error flag
 * @retval None
 */
void PWC_ClearRamParityFlag(uint8_t u8Flag)
{
    /* Parameter valid check */
    DDL_ASSERT(IS_VALID_PWC_RAM_PARITY_FLAG(u8Flag));

    PWC_POWER_REG_WRITE_ENABLE();
    CLEAR_REG8_BIT(M4_PWR->RAMCR, u8Flag);
    PWC_POWER_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or disable the Debug.
 * @param  [in] enNewState      The new state of the Debug.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_DebugCmd(en_functional_state_t enNewState)
{
    /* Parameter valid check */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    PWC_POWER_REG_WRITE_ENABLE();
    bM4_PWR->DBGC_b.DBGEN = enNewState;
    PWC_POWER_REG_WRITE_DISABLE();
}

/**
 * @}
 */

#endif  /* DDL_PWC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
